index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-22 Thu 20:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Volodymyr Vitvitskyi" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9fadbfd">Just a collection of handy snippets and links that are easy to forget.</a>
<ul>
<li><a href="#orgd1c055b">Git</a></li>
<li><a href="#org326cada">Changelog</a></li>
<li><a href="#org3c55079">Python</a>
<ul>
<li><a href="#org66da719">Editor</a></li>
<li><a href="#orgd72e3ee">Logging</a></li>
<li><a href="#org168264b">Configuration</a></li>
<li><a href="#org9bb4297">Requests Library</a></li>
<li><a href="#org8064182">Testing</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9fadbfd" class="outline-2">
<h2 id="org9fadbfd">Just a collection of handy snippets and links that are easy to forget.</h2>
<div class="outline-text-2" id="text-org9fadbfd">
</div>
<div id="outline-container-orgd1c055b" class="outline-3">
<h3 id="orgd1c055b">Git</h3>
<div class="outline-text-3" id="text-orgd1c055b">
<ul class="org-ul">
<li><a href="https://chris.beams.io/posts/git-commit/">How to Write a Git Commit Message</a></li>
</ul>
</div>
</div>
<div id="outline-container-org326cada" class="outline-3">
<h3 id="org326cada">Changelog</h3>
<div class="outline-text-3" id="text-org326cada">
<ul class="org-ul">
<li>Convention <a href="https://keepachangelog.com/en/1.0.0/">https://keepachangelog.com/en/1.0.0/</a> ReST is preferrable.</li>
</ul>
</div>
</div>
<div id="outline-container-org3c55079" class="outline-3">
<h3 id="org3c55079">Python</h3>
<div class="outline-text-3" id="text-org3c55079">
</div>
<div id="outline-container-org66da719" class="outline-4">
<h4 id="org66da719">Editor</h4>
<div class="outline-text-4" id="text-org66da719">
<pre class="example">
'(pytest-cmd-flags "-vv -x -s --doctest-modules")
</pre>
</div>
</div>
<div id="outline-container-orgd72e3ee" class="outline-4">
<h4 id="orgd72e3ee">Logging</h4>
<div class="outline-text-4" id="text-orgd72e3ee">
<p>
Configuration logging in the code
</p>

<div class="org-src-container">
<pre class="src src-python">
  <span style="color: #8C0D40; background-color: #FAFAFA;">def</span> <span style="color: #000F55; background-color: #FAFAFA;">_init_logging</span>(level):
      logging.config.dictConfig(<span style="color: #070A01; background-color: #FAFAFA;">dict</span>(
          version=<span style="color: #8C0D40; background-color: #FAFAFA;">1</span>,
          formatters={
              <span style="color: #000F55; background-color: #FAFAFA;">'f'</span>: {<span style="color: #000F55; background-color: #FAFAFA;">'format'</span>:
                    <span style="color: #000F55; background-color: #FAFAFA;">'%(asctime)s %(levelname)s %(message)s'</span>}
          },
          handlers={
              <span style="color: #000F55; background-color: #FAFAFA;">'h'</span>: {<span style="color: #000F55; background-color: #FAFAFA;">'class'</span>: <span style="color: #000F55; background-color: #FAFAFA;">'logging.StreamHandler'</span>,
                    <span style="color: #000F55; background-color: #FAFAFA;">'formatter'</span>: <span style="color: #000F55; background-color: #FAFAFA;">'f'</span>,
                    <span style="color: #000F55; background-color: #FAFAFA;">'level'</span>: level}
          },
          root={
              <span style="color: #000F55; background-color: #FAFAFA;">'handlers'</span>: [<span style="color: #000F55; background-color: #FAFAFA;">'h'</span>],
              <span style="color: #000F55; background-color: #FAFAFA;">'level'</span>: level,
          },
          loggers={
              <span style="color: #000F55; background-color: #FAFAFA;">'inimigrate'</span>: {
                  <span style="color: #000F55; background-color: #FAFAFA;">'handlers'</span>: [],
                  <span style="color: #000F55; background-color: #FAFAFA;">'level'</span>: level,
              },
              <span style="color: #000F55; background-color: #FAFAFA;">'__main__'</span>: {
                  <span style="color: #000F55; background-color: #FAFAFA;">'handlers'</span>: [],
                  <span style="color: #000F55; background-color: #FAFAFA;">'level'</span>: level,
              }
          }
      ))
</pre>
</div>
</div>
</div>
<div id="outline-container-org168264b" class="outline-4">
<h4 id="org168264b">Configuration</h4>
<div class="outline-text-4" id="text-org168264b">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8C0D40; background-color: #FAFAFA;">import</span> os
<span style="color: #8C0D40; background-color: #FAFAFA;">import</span> re
<span style="color: #8C0D40; background-color: #FAFAFA;">from</span> functools <span style="color: #8C0D40; background-color: #FAFAFA;">import</span> partial

<span style="color: #8C0D40; background-color: #FAFAFA;">import</span> yaml


<span style="color: #000F55; background-color: #FAFAFA;">ENV_VAR_MATCHER</span> = re.<span style="color: #070A01; background-color: #FAFAFA;">compile</span>(
    r<span style="color: #000F55; background-color: #FAFAFA;">"""</span>
<span style="color: #000F55; background-color: #FAFAFA;">        \$\{       # match characters `${` literally</span>
<span style="color: #000F55; background-color: #FAFAFA;">        ([^}:\s]+) # 1st group: matches any character except `}` or `:`</span>
<span style="color: #000F55; background-color: #FAFAFA;">        :?         # matches the literal `:` character zero or one times</span>
<span style="color: #000F55; background-color: #FAFAFA;">        ([^}]+)?   # 2nd group: matches any character except `}`</span>
<span style="color: #000F55; background-color: #FAFAFA;">        \}         # match character `}` literally</span>
<span style="color: #000F55; background-color: #FAFAFA;">    """</span>, re.VERBOSE
)


<span style="color: #000F55; background-color: #FAFAFA;">IMPLICIT_ENV_VAR_MATCHER</span> = re.<span style="color: #070A01; background-color: #FAFAFA;">compile</span>(
    r<span style="color: #000F55; background-color: #FAFAFA;">"""</span>
<span style="color: #000F55; background-color: #FAFAFA;">        .*          # matches any number of any characters</span>
<span style="color: #000F55; background-color: #FAFAFA;">        \$\{.*\}    # matches any number of any characters</span>
<span style="color: #000F55; background-color: #FAFAFA;">                    # between `${` and `}` literally</span>
<span style="color: #000F55; background-color: #FAFAFA;">        .*          # matches any number of any characters</span>
<span style="color: #000F55; background-color: #FAFAFA;">    """</span>, re.VERBOSE
)


<span style="color: #8C0D40; background-color: #FAFAFA;">def</span> <span style="color: #000F55; background-color: #FAFAFA;">_replace_env_var</span>(match):
    <span style="color: #000F55; background-color: #FAFAFA;">env_var</span>, <span style="color: #000F55; background-color: #FAFAFA;">default</span> = match.groups()
    <span style="color: #000F55; background-color: #FAFAFA;">value</span> = os.environ.get(env_var, <span style="color: #8C0D40; background-color: #FAFAFA;">None</span>)
    <span style="color: #8C0D40; background-color: #FAFAFA;">if</span> value <span style="color: #8C0D40; background-color: #FAFAFA;">is</span> <span style="color: #8C0D40; background-color: #FAFAFA;">None</span>:
        <span style="color: #000F55; background-color: #FAFAFA; font-style: italic;"># </span><span style="color: #000F55; background-color: #FAFAFA; font-style: italic;">expand default using other vars</span>
        <span style="color: #8C0D40; background-color: #FAFAFA;">if</span> default <span style="color: #8C0D40; background-color: #FAFAFA;">is</span> <span style="color: #8C0D40; background-color: #FAFAFA;">None</span>:
            <span style="color: #000F55; background-color: #FAFAFA; font-style: italic;"># </span><span style="color: #000F55; background-color: #FAFAFA; font-style: italic;">regex module return None instead of</span>
            <span style="color: #000F55; background-color: #FAFAFA; font-style: italic;">#  </span><span style="color: #000F55; background-color: #FAFAFA; font-style: italic;">'' if engine didn't entered default capture group</span>
            <span style="color: #000F55; background-color: #FAFAFA;">default</span> = <span style="color: #000F55; background-color: #FAFAFA;">''</span>

        <span style="color: #000F55; background-color: #FAFAFA;">value</span> = default
        <span style="color: #8C0D40; background-color: #FAFAFA;">while</span> IMPLICIT_ENV_VAR_MATCHER.match(value):  <span style="color: #000F55; background-color: #FAFAFA; font-style: italic;"># </span><span style="color: #000F55; background-color: #FAFAFA; font-style: italic;">pragma: no cover</span>
            <span style="color: #000F55; background-color: #FAFAFA;">value</span> = ENV_VAR_MATCHER.sub(_replace_env_var, value)
    <span style="color: #8C0D40; background-color: #FAFAFA;">return</span> value


<span style="color: #8C0D40; background-color: #FAFAFA;">def</span> <span style="color: #000F55; background-color: #FAFAFA;">env_var_constructor</span>(loader, node, raw=<span style="color: #8C0D40; background-color: #FAFAFA;">False</span>):
    <span style="color: #000F55; background-color: #FAFAFA;">raw_value</span> = loader.construct_scalar(node)
    <span style="color: #000F55; background-color: #FAFAFA;">value</span> = ENV_VAR_MATCHER.sub(_replace_env_var, raw_value)
    <span style="color: #8C0D40; background-color: #FAFAFA;">return</span> value <span style="color: #8C0D40; background-color: #FAFAFA;">if</span> raw <span style="color: #8C0D40; background-color: #FAFAFA;">else</span> yaml.safe_load(value)


<span style="color: #8C0D40; background-color: #FAFAFA;">def</span> <span style="color: #000F55; background-color: #FAFAFA;">setup_yaml_parser</span>():
    yaml.add_constructor(<span style="color: #000F55; background-color: #FAFAFA;">'!env_var'</span>, env_var_constructor)
    yaml.add_constructor(<span style="color: #000F55; background-color: #FAFAFA;">'!raw_env_var'</span>,
                         partial(env_var_constructor, raw=<span style="color: #8C0D40; background-color: #FAFAFA;">True</span>))
    yaml.add_implicit_resolver(<span style="color: #000F55; background-color: #FAFAFA;">'!env_var'</span>, IMPLICIT_ENV_VAR_MATCHER)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9bb4297" class="outline-4">
<h4 id="org9bb4297">Requests Library</h4>
<div class="outline-text-4" id="text-org9bb4297">
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #8C0D40; background-color: #FAFAFA;">import</span> http.client
    <span style="color: #8C0D40; background-color: #FAFAFA;">import</span> logging
    <span style="color: #000F55; background-color: #FAFAFA;">http.client.HTTPConnection.debuglevel</span> = <span style="color: #8C0D40; background-color: #FAFAFA;">1</span>

    logging.basicConfig()
    logging.getLogger().setLevel(logging.DEBUG)
    <span style="color: #000F55; background-color: #FAFAFA;">requests_log</span> = logging.getLogger(<span style="color: #000F55; background-color: #FAFAFA;">"requests.packages.urllib3"</span>)
    requests_log.setLevel(logging.DEBUG)
    <span style="color: #000F55; background-color: #FAFAFA;">requests_log.propagate</span> = <span style="color: #8C0D40; background-color: #FAFAFA;">True</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8064182" class="outline-4">
<h4 id="org8064182">Testing</h4>
<div class="outline-text-4" id="text-org8064182">
</div>
<ul class="org-ul">
<li><a id="org2a1e0c7"></a>Coverage<br />
<div class="outline-text-5" id="text-org2a1e0c7">
<p>
It is possible to fix the lower bound for coverage.
</p>
<pre class="example">
# .coveragerc
[report]
fail_under = 90
</pre>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Volodymyr Vitvitskyi</p>
<p class="date">Created: 2018-11-22 Thu 20:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
